---
kind: method
id: M:Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent.GetLoadResults
source: html/48d39b70-996b-bfd4-4ed0-925cfb19a918.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent.GetLoadResults Method

Returns a copy of the KeyBasedTreeEntriesLoadResults owned by this KeyBasedTreeEntriesLoadContent object.

## Syntax (C#)
```csharp
public KeyBasedTreeEntriesLoadResults GetLoadResults()
```

## Returns
A copy of a KeyBasedTreeEntriesLoadResults owned by this KeyBasedTreeEntriesLoadContent object.

## Remarks
IExternalResourceServers can use this object to report data and results
 back to Revit from their LoadResource methods.